<a href="https://colab.research.google.com/github/NayeonKeum/ToyProjects/blob/master/cafe/ml_inheon.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from sklearn.neighbors import KNeighborsClassifier
from sklearn.tree import DecisionTreeClassifier
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC

import numpy as np

In [ ]:
import pandas as pd

In [ ]:
test=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data_2020cafe/test_inheo.csv")
train_data=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data_2020cafe/train_data_inheo.csv")
train=pd.read_csv("/content/drive/My Drive/Colab Notebooks/data_2020cafe/train_inheo.csv")

In [ ]:
target=train['성공여부']

In [ ]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21055 entries, 0 to 21054
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21055 non-null  int64
 1   시설총규모       21055 non-null  float64
 2   업소위치분기      21055 non-null  int64
 3   distance    21055 non-null  float64
 4   성공여부        21055 non-null  int64
 5   창업월         21055 non-null  int64
 6   구_1_25      21055 non-null  int64
 7   프랜차이즈여부_02  21055 non-null  int64
 8   sub_19      21055 non-null  int64
dtypes: float64(2), int64(7)
memory usage: 1.4 MB

In [ ]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21055 entries, 0 to 21054
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21055 non-null  int64
 1   시설총규모       21055 non-null  float64
 2   업소위치분기      21055 non-null  int64
 3   distance    21055 non-null  float64
 4   창업월         21055 non-null  int64
 5   구_1_25      21055 non-null  int64
 6   프랜차이즈여부_02  21055 non-null  int64
 7   sub_19      21055 non-null  int64
dtypes: float64(2), int64(6)
memory usage: 1.3 MB

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9024 entries, 0 to 9023
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9024 non-null   int64
 1   사업장명        9024 non-null   object
 2   시설총규모       9024 non-null   float64
 3   업소위치분기      9024 non-null   int64
 4   distance    9024 non-null   float64
 5   성공여부        9024 non-null   int64
 6   창업월         9024 non-null   int64
 7   구_1_25      9024 non-null   int64
 8   프랜차이즈여부_02  9024 non-null   int64
 9   sub_19      9024 non-null   int64
dtypes: float64(2), int64(7), object(1)
memory usage: 705.1+ KB

In [ ]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold=KFold(n_splits=10, shuffle=True, random_state=0)

In [ ]:
#kNN
clf=KNeighborsClassifier(n_neighbors=4)#개 높은데 일단 보류
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.62725546 0.62630579 0.61965812 0.62583096 0.64150047 0.61377672
 0.62327791 0.61472684 0.63372922 0.63942993]

In [ ]:
round(np.mean(score)*100,2)

62.65

In [ ]:
#decision tree
clf=DecisionTreeClassifier(max_depth=5)# 프루닝을 해서 정확도 상승
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.7345679  0.7374169  0.7302944  0.74406458 0.74311491 0.73539192
 0.73349169 0.74394299 0.74774347 0.72114014]

In [ ]:
round(np.mean(score)*100,2)

73.71

In [ ]:
#random forest
clf=RandomForestClassifier(n_estimators=3,max_depth=5)# 프루닝을 해서 정확도 상승
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.73694207 0.7331434  0.73076923 0.74311491 0.75356125 0.73396675
 0.72209026 0.74204276 0.74536817 0.72351544]

In [ ]:
round(np.mean(score)*100,2)

73.65

In [ ]:
#naive bayes
clf=GaussianNB()
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.71035138 0.71272555 0.70797721 0.72032289 0.73504274 0.71733967
 0.70546318 0.71638955 0.43182898 0.70973872]

In [ ]:
round(np.mean(score)*100,2)

68.67

In [ ]:
#svm
clf=SVC()
scoring='accuracy'
score=cross_val_score(clf, train_data, target, cv=k_fold, n_jobs=1, scoring=scoring)
print(score)

[0.72649573 0.72459639 0.71937322 0.72981956 0.74216524 0.72684086
 0.72019002 0.73016627 0.74204276 0.71258907]

In [ ]:
round(np.mean(score)*100,2)

72.74

In [ ]:
train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21055 entries, 0 to 21054
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  21055 non-null  int64
 1   시설총규모       21055 non-null  float64
 2   업소위치분기      21055 non-null  int64
 3   distance    21055 non-null  float64
 4   창업월         21055 non-null  int64
 5   구_1_25      21055 non-null  int64
 6   프랜차이즈여부_02  21055 non-null  int64
 7   sub_19      21055 non-null  int64
dtypes: float64(2), int64(6)
memory usage: 1.3 MB

In [ ]:
'''
#test!!-decision tree
clf=DecisionTreeClassifier()#max_depth=5)#
clf.fit(train_data,target)
test_data=test.drop(['사업장명','성공여부'], axis=1).copy()
prediction=clf.predict(test_data)
'''

In [ ]:

#rf
clf=RandomForestClassifier(n_estimators=5)#,max_depth=5)
clf.fit(train_data,target)
scoring='accuracy'
test_data=test.drop(['사업장명','성공여부'], axis=1).copy()
prediction=clf.predict(test_data)

In [ ]:
submission=pd.DataFrame({'사업장명':test['사업장명'],"성공":prediction})
submission.to_csv('/content/drive/My Drive/Colab Notebooks/data_2020cafe/submission_inheo.csv',index=False)

In [ ]:
submission=pd.read_csv('/content/drive/My Drive/Colab Notebooks/data_2020cafe/submission_inheo.csv')
submission.head()

          사업장명  성공
0         갈채다방   1
1    텀브커피 무교동점   1
2  더카페엔여의도백화점점   1
3    바이올렛에스프레소   1
4         카슈카슈   1

In [ ]:
submission.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9024 entries, 0 to 9023
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   사업장명    9024 non-null   object
 1   성공      9024 non-null   int64
dtypes: int64(1), object(1)
memory usage: 141.1+ KB

In [ ]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9024 entries, 0 to 9023
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9024 non-null   int64
 1   사업장명        9024 non-null   object
 2   시설총규모       9024 non-null   float64
 3   업소위치분기      9024 non-null   int64
 4   distance    9024 non-null   float64
 5   성공여부        9024 non-null   int64
 6   창업월         9024 non-null   int64
 7   구_1_25      9024 non-null   int64
 8   프랜차이즈여부_02  9024 non-null   int64
 9   sub_19      9024 non-null   int64
dtypes: float64(2), int64(7), object(1)
memory usage: 705.1+ KB

In [ ]:
sub=pd.DataFrame(submission['성공'])
testy=pd.DataFrame(test['성공여부'])

In [ ]:
sub.info()
sub

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9024 entries, 0 to 9023
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   성공      9024 non-null   int64
dtypes: int64(1)
memory usage: 70.6 KB

      성공
0      1
1      1
2      1
3      1
4      1
...   ..
9019   1
9020   1
9021   1
9022   1
9023   1

[9024 rows x 1 columns]

In [ ]:
#testy=testy.reset_index(drop=True)
testy

      성공여부
0        1
1        0
2        1
3        1
4        1
...    ...
9019     1
9020     1
9021     1
9022     1
9023     1

[9024 rows x 1 columns]

In [ ]:
df=pd.concat([sub, testy],axis=1)
df

      성공  성공여부
0      1     1
1      1     0
2      1     1
3      1     1
4      1     1
...   ..   ...
9019   1     1
9020   1     1
9021   1     1
9022   1     1
9023   1     1

[9024 rows x 2 columns]

In [ ]:
df['scorey']=(df['성공']==df['성공여부'])

In [ ]:
df['scorey'].value_counts()

True     7937
False    1087
Name: scorey, dtype: int64

In [ ]:
print("제 점수는 : ",7937/9024*100)

제 점수는 :  87.9543439716312